# ========================list基本方法===========================
# 用途: 用于存一个或者多个不同类型的值
# 定义方式: 通过中括号存值，每个值之间通过逗号进行分隔
# 常用方法:

# 优先掌握的知识点

# 1、索引取值(正反都可以)，不仅可以取还可以存
# l1 = [1, 2, 3, 4,5]
# print(l1[2])
# l1[2] = 222
# print(l1)
# 2、索引切片
# print(l1[1:4])

# 3、append() : 追加值。只能添加到列表的最后一位,一次性只能添加一个值

# l1.append(10000)
# print(l1)
# l1.append([9,0])
# print(l1)

# 4、insert()  : 插入值，通过索引指定插入的位置

# l1.insert(3,999)
# print(l1)

# 5、extend()

# l1.extend([6,7,8])
# print(l1)

# 6：remove : 指定值删除，比较彻底
# l1.remove(1)
# print(l1)

# 7、pop()  : 不传值，默认从最后开始删，指定索引删值,pop是有返回值的
l1 = [1, 2, 3, 4,5]

val = l1.pop(2)
print(l1)
print(val)
# l1.pop()
# print(l1)
# l1.pop()
# print(l1)
# l1.pop()
# print(l1)




# =========================类型总结==========================
# 有序or无序
# 可变or不可变
# 存一个值or存多个值
