# ========================基本方法===========================
# 用途: 一般用于定义整数：年龄、身份证号、qq号
# 定义方式:
# age = 18 # age = int(18)
# 常用方法:
# 数学计算：

# 进制之间的转换：
"""
其他进制转10进制

二进制转十进制：0，1

110  1 * (2**2) + 1 * (2**1) + 0 * (2**0)  = 4 + 2 + 0 = 6

八进制转十进制：0-7

123 1 * (8**2) + 2 * (8**1) + 3 * (8**0) = 64 + 16 + 3 = 83

十六进制转十进制：0-9 a-f

321 3 * (16 ** 2) + 2 * (16 ** 1) + 1 * (16**0) = 768 + 32 + 1 = 801
"""
# print(int("110",2))

# print(int("123",8))

# print(int("321",16))

"""
10进制转其他进制: 0-9
"""
# 十进制转二进制：
# print(bin(108))  # 0b 1101100

# 十进制转八进制：
# print(oct(83))   # 0o 123

# 十进制转十六进制：
# print(hex(1000))  # 0x 3e8





# =========================类型总结==========================
# 有序or无序  # 有索引的类型都是有序的    无序
# 可变or不可变  # int整型是不可变类型
"""
值变id不变就是可变类型
值变id也变就是不可变类型
"""

# a = 10
# print(a)
# print(id(a))
# a = 11
# print(a)
# print(id(a))

# l1 = [1,2,3]
# print(l1)
# print(id(l1))
# l1[0] = 111
# print(l1)
# print(id(l1))
# 存一个值or存多个值  # 存一个值


# ========================基本方法===========================
# 用途:用于记录小数，身高，体重，薪资
# 定义方式: height = 1.0  # height = float(1.0)
# 常用方法:
# 数学计算

# s1 = '1.0'
# f1 = float(s1)
# print(f1)
# print(type(f1))
# a1 = int(f1)
# print(a1)




# =========================类型总结==========================
# 有序or无序 无序
# 可变or不可变  不可变
# 存一个值or存多个值  存一个值